Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.IsSubPart Method
 Check if this analysis part is a sub analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsSubPart()
Public Function IsSubPart As Boolean
Return Value
Type: Boolean
True if this analysis part is a sub part.
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace